----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 512, 512]             864
       BatchNorm2d-2         [-1, 32, 512, 512]              64
         LeakyReLU-3         [-1, 32, 512, 512]               0
          CNNBlock-4         [-1, 32, 512, 512]               0
            Conv2d-5         [-1, 64, 256, 256]          18,432
       BatchNorm2d-6         [-1, 64, 256, 256]             128
         LeakyReLU-7         [-1, 64, 256, 256]               0
          CNNBlock-8         [-1, 64, 256, 256]               0
            Conv2d-9         [-1, 32, 256, 256]           2,080
      BatchNorm2d-10         [-1, 32, 256, 256]              64
        LeakyReLU-11         [-1, 32, 256, 256]               0
           Conv2d-12         [-1, 64, 256, 256]          18,496
      BatchNorm2d-13         [-1, 64, 256, 256]             128
        LeakyReLU-14         [-1, 64, 256, 256]               0
    ResidualBlock-15         [-1, 64, 256, 256]               0
           Conv2d-16        [-1, 128, 128, 128]          73,728
      BatchNorm2d-17        [-1, 128, 128, 128]             256
        LeakyReLU-18        [-1, 128, 128, 128]               0
         CNNBlock-19        [-1, 128, 128, 128]               0
           Conv2d-20         [-1, 64, 128, 128]           8,256
      BatchNorm2d-21         [-1, 64, 128, 128]             128
        LeakyReLU-22         [-1, 64, 128, 128]               0
           Conv2d-23        [-1, 128, 128, 128]          73,856
      BatchNorm2d-24        [-1, 128, 128, 128]             256
        LeakyReLU-25        [-1, 128, 128, 128]               0
           Conv2d-26         [-1, 64, 128, 128]           8,256
      BatchNorm2d-27         [-1, 64, 128, 128]             128
        LeakyReLU-28         [-1, 64, 128, 128]               0
           Conv2d-29        [-1, 128, 128, 128]          73,856
      BatchNorm2d-30        [-1, 128, 128, 128]             256
        LeakyReLU-31        [-1, 128, 128, 128]               0
    ResidualBlock-32        [-1, 128, 128, 128]               0
           Conv2d-33          [-1, 256, 64, 64]         294,912
      BatchNorm2d-34          [-1, 256, 64, 64]             512
        LeakyReLU-35          [-1, 256, 64, 64]               0
         CNNBlock-36          [-1, 256, 64, 64]               0
           Conv2d-37          [-1, 128, 64, 64]          32,896
      BatchNorm2d-38          [-1, 128, 64, 64]             256
        LeakyReLU-39          [-1, 128, 64, 64]               0
           Conv2d-40          [-1, 256, 64, 64]         295,168
      BatchNorm2d-41          [-1, 256, 64, 64]             512
        LeakyReLU-42          [-1, 256, 64, 64]               0
           Conv2d-43          [-1, 128, 64, 64]          32,896
      BatchNorm2d-44          [-1, 128, 64, 64]             256
        LeakyReLU-45          [-1, 128, 64, 64]               0
           Conv2d-46          [-1, 256, 64, 64]         295,168
      BatchNorm2d-47          [-1, 256, 64, 64]             512
        LeakyReLU-48          [-1, 256, 64, 64]               0
           Conv2d-49          [-1, 128, 64, 64]          32,896
      BatchNorm2d-50          [-1, 128, 64, 64]             256
        LeakyReLU-51          [-1, 128, 64, 64]               0
           Conv2d-52          [-1, 256, 64, 64]         295,168
      BatchNorm2d-53          [-1, 256, 64, 64]             512
        LeakyReLU-54          [-1, 256, 64, 64]               0
           Conv2d-55          [-1, 128, 64, 64]          32,896
      BatchNorm2d-56          [-1, 128, 64, 64]             256
        LeakyReLU-57          [-1, 128, 64, 64]               0
           Conv2d-58          [-1, 256, 64, 64]         295,168
      BatchNorm2d-59          [-1, 256, 64, 64]             512
        LeakyReLU-60          [-1, 256, 64, 64]               0
           Conv2d-61          [-1, 128, 64, 64]          32,896
      BatchNorm2d-62          [-1, 128, 64, 64]             256
        LeakyReLU-63          [-1, 128, 64, 64]               0
           Conv2d-64          [-1, 256, 64, 64]         295,168
      BatchNorm2d-65          [-1, 256, 64, 64]             512
        LeakyReLU-66          [-1, 256, 64, 64]               0
           Conv2d-67          [-1, 128, 64, 64]          32,896
      BatchNorm2d-68          [-1, 128, 64, 64]             256
        LeakyReLU-69          [-1, 128, 64, 64]               0
           Conv2d-70          [-1, 256, 64, 64]         295,168
      BatchNorm2d-71          [-1, 256, 64, 64]             512
        LeakyReLU-72          [-1, 256, 64, 64]               0
           Conv2d-73          [-1, 128, 64, 64]          32,896
      BatchNorm2d-74          [-1, 128, 64, 64]             256
        LeakyReLU-75          [-1, 128, 64, 64]               0
           Conv2d-76          [-1, 256, 64, 64]         295,168
      BatchNorm2d-77          [-1, 256, 64, 64]             512
        LeakyReLU-78          [-1, 256, 64, 64]               0
           Conv2d-79          [-1, 128, 64, 64]          32,896
      BatchNorm2d-80          [-1, 128, 64, 64]             256
        LeakyReLU-81          [-1, 128, 64, 64]               0
           Conv2d-82          [-1, 256, 64, 64]         295,168
      BatchNorm2d-83          [-1, 256, 64, 64]             512
        LeakyReLU-84          [-1, 256, 64, 64]               0
    ResidualBlock-85          [-1, 256, 64, 64]               0
           Conv2d-86          [-1, 512, 32, 32]       1,179,648
      BatchNorm2d-87          [-1, 512, 32, 32]           1,024
        LeakyReLU-88          [-1, 512, 32, 32]               0
         CNNBlock-89          [-1, 512, 32, 32]               0
           Conv2d-90          [-1, 256, 32, 32]         131,328
      BatchNorm2d-91          [-1, 256, 32, 32]             512
        LeakyReLU-92          [-1, 256, 32, 32]               0
           Conv2d-93          [-1, 512, 32, 32]       1,180,160
      BatchNorm2d-94          [-1, 512, 32, 32]           1,024
        LeakyReLU-95          [-1, 512, 32, 32]               0
           Conv2d-96          [-1, 256, 32, 32]         131,328
      BatchNorm2d-97          [-1, 256, 32, 32]             512
        LeakyReLU-98          [-1, 256, 32, 32]               0
           Conv2d-99          [-1, 512, 32, 32]       1,180,160
     BatchNorm2d-100          [-1, 512, 32, 32]           1,024
       LeakyReLU-101          [-1, 512, 32, 32]               0
          Conv2d-102          [-1, 256, 32, 32]         131,328
     BatchNorm2d-103          [-1, 256, 32, 32]             512
       LeakyReLU-104          [-1, 256, 32, 32]               0
          Conv2d-105          [-1, 512, 32, 32]       1,180,160
     BatchNorm2d-106          [-1, 512, 32, 32]           1,024
       LeakyReLU-107          [-1, 512, 32, 32]               0
          Conv2d-108          [-1, 256, 32, 32]         131,328
     BatchNorm2d-109          [-1, 256, 32, 32]             512
       LeakyReLU-110          [-1, 256, 32, 32]               0
          Conv2d-111          [-1, 512, 32, 32]       1,180,160
     BatchNorm2d-112          [-1, 512, 32, 32]           1,024
       LeakyReLU-113          [-1, 512, 32, 32]               0
          Conv2d-114          [-1, 256, 32, 32]         131,328
     BatchNorm2d-115          [-1, 256, 32, 32]             512
       LeakyReLU-116          [-1, 256, 32, 32]               0
          Conv2d-117          [-1, 512, 32, 32]       1,180,160
     BatchNorm2d-118          [-1, 512, 32, 32]           1,024
       LeakyReLU-119          [-1, 512, 32, 32]               0
          Conv2d-120          [-1, 256, 32, 32]         131,328
     BatchNorm2d-121          [-1, 256, 32, 32]             512
       LeakyReLU-122          [-1, 256, 32, 32]               0
          Conv2d-123          [-1, 512, 32, 32]       1,180,160
     BatchNorm2d-124          [-1, 512, 32, 32]           1,024
       LeakyReLU-125          [-1, 512, 32, 32]               0
          Conv2d-126          [-1, 256, 32, 32]         131,328
     BatchNorm2d-127          [-1, 256, 32, 32]             512
       LeakyReLU-128          [-1, 256, 32, 32]               0
          Conv2d-129          [-1, 512, 32, 32]       1,180,160
     BatchNorm2d-130          [-1, 512, 32, 32]           1,024
       LeakyReLU-131          [-1, 512, 32, 32]               0
          Conv2d-132          [-1, 256, 32, 32]         131,328
     BatchNorm2d-133          [-1, 256, 32, 32]             512
       LeakyReLU-134          [-1, 256, 32, 32]               0
          Conv2d-135          [-1, 512, 32, 32]       1,180,160
     BatchNorm2d-136          [-1, 512, 32, 32]           1,024
       LeakyReLU-137          [-1, 512, 32, 32]               0
   ResidualBlock-138          [-1, 512, 32, 32]               0
          Conv2d-139         [-1, 1024, 16, 16]       4,718,592
     BatchNorm2d-140         [-1, 1024, 16, 16]           2,048
       LeakyReLU-141         [-1, 1024, 16, 16]               0
        CNNBlock-142         [-1, 1024, 16, 16]               0
          Conv2d-143          [-1, 512, 16, 16]         524,800
     BatchNorm2d-144          [-1, 512, 16, 16]           1,024
       LeakyReLU-145          [-1, 512, 16, 16]               0
          Conv2d-146         [-1, 1024, 16, 16]       4,719,616
     BatchNorm2d-147         [-1, 1024, 16, 16]           2,048
       LeakyReLU-148         [-1, 1024, 16, 16]               0
          Conv2d-149          [-1, 512, 16, 16]         524,800
     BatchNorm2d-150          [-1, 512, 16, 16]           1,024
       LeakyReLU-151          [-1, 512, 16, 16]               0
          Conv2d-152         [-1, 1024, 16, 16]       4,719,616
     BatchNorm2d-153         [-1, 1024, 16, 16]           2,048
       LeakyReLU-154         [-1, 1024, 16, 16]               0
          Conv2d-155          [-1, 512, 16, 16]         524,800
     BatchNorm2d-156          [-1, 512, 16, 16]           1,024
       LeakyReLU-157          [-1, 512, 16, 16]               0
          Conv2d-158         [-1, 1024, 16, 16]       4,719,616
     BatchNorm2d-159         [-1, 1024, 16, 16]           2,048
       LeakyReLU-160         [-1, 1024, 16, 16]               0
          Conv2d-161          [-1, 512, 16, 16]         524,800
     BatchNorm2d-162          [-1, 512, 16, 16]           1,024
       LeakyReLU-163          [-1, 512, 16, 16]               0
          Conv2d-164         [-1, 1024, 16, 16]       4,719,616
     BatchNorm2d-165         [-1, 1024, 16, 16]           2,048
       LeakyReLU-166         [-1, 1024, 16, 16]               0
   ResidualBlock-167         [-1, 1024, 16, 16]               0
          Conv2d-168          [-1, 512, 16, 16]         524,288
     BatchNorm2d-169          [-1, 512, 16, 16]           1,024
       LeakyReLU-170          [-1, 512, 16, 16]               0
        CNNBlock-171          [-1, 512, 16, 16]               0
          Conv2d-172         [-1, 1024, 16, 16]       4,718,592
     BatchNorm2d-173         [-1, 1024, 16, 16]           2,048
       LeakyReLU-174         [-1, 1024, 16, 16]               0
        CNNBlock-175         [-1, 1024, 16, 16]               0
          Conv2d-176          [-1, 512, 16, 16]         524,800
     BatchNorm2d-177          [-1, 512, 16, 16]           1,024
       LeakyReLU-178          [-1, 512, 16, 16]               0
          Conv2d-179         [-1, 1024, 16, 16]       4,719,616
     BatchNorm2d-180         [-1, 1024, 16, 16]           2,048
       LeakyReLU-181         [-1, 1024, 16, 16]               0
   ResidualBlock-182         [-1, 1024, 16, 16]               0
          Conv2d-183          [-1, 512, 16, 16]         524,288
     BatchNorm2d-184          [-1, 512, 16, 16]           1,024
       LeakyReLU-185          [-1, 512, 16, 16]               0
        CNNBlock-186          [-1, 512, 16, 16]               0
          Conv2d-187         [-1, 1024, 16, 16]       4,719,616
     BatchNorm2d-188         [-1, 1024, 16, 16]           2,048
       LeakyReLU-189         [-1, 1024, 16, 16]               0
          Conv2d-190           [-1, 21, 16, 16]          21,525
 ScalePrediction-191         [-1, 3, 16, 16, 7]               0
          Conv2d-192          [-1, 256, 16, 16]         131,072
     BatchNorm2d-193          [-1, 256, 16, 16]             512
       LeakyReLU-194          [-1, 256, 16, 16]               0
        CNNBlock-195          [-1, 256, 16, 16]               0
        Upsample-196          [-1, 256, 32, 32]               0
          Conv2d-197          [-1, 256, 32, 32]         196,608
     BatchNorm2d-198          [-1, 256, 32, 32]             512
       LeakyReLU-199          [-1, 256, 32, 32]               0
        CNNBlock-200          [-1, 256, 32, 32]               0
          Conv2d-201          [-1, 512, 32, 32]       1,179,648
     BatchNorm2d-202          [-1, 512, 32, 32]           1,024
       LeakyReLU-203          [-1, 512, 32, 32]               0
        CNNBlock-204          [-1, 512, 32, 32]               0
          Conv2d-205          [-1, 256, 32, 32]         131,328
     BatchNorm2d-206          [-1, 256, 32, 32]             512
       LeakyReLU-207          [-1, 256, 32, 32]               0
          Conv2d-208          [-1, 512, 32, 32]       1,180,160
     BatchNorm2d-209          [-1, 512, 32, 32]           1,024
       LeakyReLU-210          [-1, 512, 32, 32]               0
   ResidualBlock-211          [-1, 512, 32, 32]               0
          Conv2d-212          [-1, 256, 32, 32]         131,072
     BatchNorm2d-213          [-1, 256, 32, 32]             512
       LeakyReLU-214          [-1, 256, 32, 32]               0
        CNNBlock-215          [-1, 256, 32, 32]               0
          Conv2d-216          [-1, 512, 32, 32]       1,180,160
     BatchNorm2d-217          [-1, 512, 32, 32]           1,024
       LeakyReLU-218          [-1, 512, 32, 32]               0
          Conv2d-219           [-1, 21, 32, 32]          10,773
 ScalePrediction-220         [-1, 3, 32, 32, 7]               0
          Conv2d-221          [-1, 128, 32, 32]          32,768
     BatchNorm2d-222          [-1, 128, 32, 32]             256
       LeakyReLU-223          [-1, 128, 32, 32]               0
        CNNBlock-224          [-1, 128, 32, 32]               0
        Upsample-225          [-1, 128, 64, 64]               0
          Conv2d-226          [-1, 128, 64, 64]          49,152
     BatchNorm2d-227          [-1, 128, 64, 64]             256
       LeakyReLU-228          [-1, 128, 64, 64]               0
        CNNBlock-229          [-1, 128, 64, 64]               0
          Conv2d-230          [-1, 256, 64, 64]         294,912
     BatchNorm2d-231          [-1, 256, 64, 64]             512
       LeakyReLU-232          [-1, 256, 64, 64]               0
        CNNBlock-233          [-1, 256, 64, 64]               0
          Conv2d-234          [-1, 128, 64, 64]          32,896
     BatchNorm2d-235          [-1, 128, 64, 64]             256
       LeakyReLU-236          [-1, 128, 64, 64]               0
          Conv2d-237          [-1, 256, 64, 64]         295,168
     BatchNorm2d-238          [-1, 256, 64, 64]             512
       LeakyReLU-239          [-1, 256, 64, 64]               0
   ResidualBlock-240          [-1, 256, 64, 64]               0
          Conv2d-241          [-1, 128, 64, 64]          32,768
     BatchNorm2d-242          [-1, 128, 64, 64]             256
       LeakyReLU-243          [-1, 128, 64, 64]               0
        CNNBlock-244          [-1, 128, 64, 64]               0
          Conv2d-245          [-1, 256, 64, 64]         295,168
     BatchNorm2d-246          [-1, 256, 64, 64]             512
       LeakyReLU-247          [-1, 256, 64, 64]               0
          Conv2d-248           [-1, 21, 64, 64]           5,397
 ScalePrediction-249         [-1, 3, 64, 64, 7]               0
================================================================
Total params: 61,549,439
Trainable params: 61,549,439
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.00
Forward/backward pass size (MB): 1566.72
Params size (MB): 234.79
Estimated Total Size (MB): 1804.52
----------------------------------------------------------------
